Here is hosted zone creation for ellingson.io

```
------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.dns.aws_route53_zone.secops-ctf-zone will be created
  + resource "aws_route53_zone" "secops-ctf-zone" {
      + comment       = "Managed by Terraform"
      + force_destroy = false
      + id            = (known after apply)
      + name          = "ellingson.io"
      + name_servers  = (known after apply)
      + zone_id       = (known after apply)

      + vpc {
          + vpc_id     = "vpc-a5c56bce"
          + vpc_region = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

This plan was saved to: franklin.out

To perform exactly these actions, run the following command to apply:
    terraform apply "franklin.out"

```